#coding: utf8
'''
以浮點運算時, 考慮二進位捨入誤差補償的版本
紙鈔種類有 100, 50, 20, 10, 5, 1 元共四種
硬幣種類則有 0.25, 0.1 與 0.01 等共三種
透過找錢函數, 可以將總額輸入換成上列各種紙鈔與硬幣
'''
def 找錢(總額):
    換錢組合 = ()
    找錢總額 = 總額
    驗算值 = 0
    for 紙鈔與銅板 in [100,50,20,10,5,1,0.25,0.1,0.01]:
        # 注意 reset 換幾張變數的位置
        換幾張 = 0
        # 考慮二進位捨入誤差補償
        while 總額 >= (紙鈔與銅板 - 0.001):
            換錢組合 += (紙鈔與銅板,)
            換幾張 += 1
            總額 -= 紙鈔與銅板
            #print("現在總額",總額)
        #print(str(紙鈔與銅板)+"元,需要"+str(換幾張)+"個")
    驗算值 = round(sum(換錢組合),2)
    # 若執行換算時有誤差出現, 則印出換算結果
    if (驗算值 - 找錢總額) > 0 or (驗算值 - 找錢總額) < 0 :
        print ("應找:", 找錢總額,"驗算值:",驗算值,"誤差為:",驗算值 - 找錢總額,"換錢組合",換錢組合)
    #print ("應找:", 找錢總額,"驗算值:",驗算值,"誤差為:",驗算值 - 找錢總額,"換錢組合",換錢組合)
    #return 換錢組合
 
# 進行驗算
def 換錢驗算(開始, 結束):
    #開始 = 1
    #結束 = 1000
    for i in range(開始,結束+1):
        驗算輸入 = round(i*0.01,2)
        #print(驗算輸入,end="")
        找錢(驗算輸入)
    #print("已經完成由 ",開始,"到 ",結束," 的驗算測試")
 
# 計算程式運行所花費時間
import time
 
開始時間 = time.time()
換錢驗算(1,100000)
print ("運算時間:",round(time.time() - 開始時間,6), "秒")